Revit 2027 API
Dimension.FamilyLabel Property
The family parameter label of the dimension.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilyParameter FamilyLabel { get; set; }
Public Property FamilyLabel As FamilyParameter
	Get
	Set
public:
property FamilyParameter^ FamilyLabel {
	FamilyParameter^ get ();
	void set (FamilyParameter^ value);
}
member FamilyLabel : FamilyParameter with get, set
Property Value
FamilyParameter
Exceptions
Exception | Condition
ArgumentException |  Thrown when the family parameter's ParameterType is not suitable for this dimension.
InvalidOperationException |  Thrown when dimension can not be labeled.
InvalidOperationException |  Thrown when failed to get the BuiltInParameter DIM_LABEL.
Remarks
A dimension only can be labeled to a family parameter in a family document. When the dimension is labeled by a reporting parameter, the dimension value drives the parameter value. When the parameter is labeled by a non-reporting, the value of the parameter drives the dimension. If the dimension is multi-segmented, each segment of the dimension is driven by the same parameter value. Multi-segmented dimensions cannot be labeled by reporting parameters. To unbind the family parameter, set this property to null.
See Also
Reference
Dimension Class
Autodesk.Revit.DB Namespace